"""
Задача №37. Решение в группах
15 минут
Дано натуральное число N и
последовательность из N элементов.
Требуется вывести эту последовательность в
обратном порядке.
Примечание. В программе запрещается
объявлять массивы и использовать циклы
(даже для ввода и вывода).
Input: 2 -> 3 4
Output: 4 3
"""
n = 2


# def rev(n):
#     if n > 0:
#         x = int(input("Введите число: "))
#         rev(n - 1)
#         print(x, end=" ")


# rev(n)


a = [1, 2, 3] * 3
print(a)